app/controllers/documents_controller.rb

  def index
    @documents = Document.all
---
SELECT * FROM "documents"

  def show
    @document = Document.find(params[:id])
---
SELECT * FROM "documents" WHERE ("documents"."id" = 2)

  def edit
    @document = Document.find(params[:id])
---
SELECT * FROM "documents" WHERE ("documents"."id" = 1)

  def create

    uploaded_file = params[:xml_file]
    doc = REXML::Document.new uploaded_file
    doc = parse_xml(doc)
    data = ""
    doc.write data, 0

#    data = uploaded_file.read if uploaded_file.respond_to? :read

    @document = Document.new({:title => params[:title], :content => data})

#    @document = Document.new(params[:document])

    respond_to do |format|
      if @document.save
---
INSERT INTO "documents" ("created_at", "title", "updated_at", "version", "content") VALUES('2010-03-15 02:06:53', 'XML Test File 1', '2010-03-15 02:06:53', 1, '<us-patent-application dtd-version=''v4.2 2006-08-23'' country=''US'' date-publ=''20070906'' date-produced=''20070822'' id=''us-patent-application'' lang=''EN'' file=''US20070208822A1-20070906.XML'' status=''PRODUCTION''>

  def destroy
    @document = Document.find(params[:id])
    @document.destroy
---
SELECT * FROM "documents" WHERE ("documents"."id" = 2)
DELETE FROM "documents" WHERE "id" = 2